# **PANDAS : SERIES**

In [3]:
import numpy as np
import pandas as pd

In [4]:
label = 'A B C D E'.split()
data1 = [1,2,3,4,5]
data2 = np.random.randint(1,100,5)
data3 = [2, "ABC", 5 , 10.3, -12]
data4 = {
    'Baris 1' : 5,
    'Baris 2' : 2,
    'Baris 3' : 12,
}

In [5]:
pd.Series(data1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
pd.Series(data1, label)

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [7]:
pd.Series(index = label, data = data1) #the posititon could be swaped but should use a katerangan which one is the label, data, etc.

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [8]:
?pd.Series #run untuk melihat help/documentation

Object `pd.Series #run untuk melihat help/documentation` not found.

In [9]:
pd.Series(data4) #Dictionary couldn't be paired with label cause they have own labels.

Baris 1     5
Baris 2     2
Baris 3    12
dtype: int64

# **PANDAS DATA FRAME**

In [10]:
pd.DataFrame([data1,data2,data3])

   0    1  2     3   4
0  1    2  3   4.0   5
1  3   10  4  70.0  90
2  2  ABC  5  10.3 -12

In [11]:
df = pd.DataFrame(np.random.randint(1,100,(5,4)), #5,4 col row
                  columns = ('Col1','Col2','Col3','Col4'), #change the col label
                )
                  #index = np.arange(5,10)) #change the row label
df

   Col1  Col2  Col3  Col4
0    66    74    99    86
1    29    12    27    26
2    52    27    83    68
3    71     9    34    61
4    21    77    55     4

In [12]:
dfkol1 = df['Col1'] #df.col1

In [13]:
df1 = pd.DataFrame({
    'Kolom 1' : dfkol1,
    'Kolom 2' : data2,
    'Kolom 3' : data3,  
})
df1

   Kolom 1  Kolom 2 Kolom 3
0       66        3       2
1       29       10     ABC
2       52        4       5
3       71       70    10.3
4       21       90     -12

# **PANDAS DATAFRAME ADV**

In [14]:
df[['Col1']]
df[['Col1']][:3]
df.dtypes

Col1    int64
Col2    int64
Col3    int64
Col4    int64
dtype: object

In [47]:
df['Col5'] = np.random.randn(5)
df

   Col1  Col2  Col3  Col4      Col5
0    61    89    72    86 -0.807552
1    11    64    83    25 -0.627360
2    82    96    55    23  1.998618
3    52    54    73    81 -0.261458
4    18     9    82     3 -0.799613

In [65]:
df_new = df[['Col3', 'Col5', 'Col4']][:4]
df_new

   Col3      Col5  Col4
0    72 -0.807552    86
1    83 -0.627360    25
2    55  1.998618    23
3    73 -0.261458    81

In [82]:
df_new.loc[2:3]

   Col3      Col5  Col4
2    55  1.998618    23
3    73 -0.261458    81

In [70]:
df_new.loc[2:3,['Col3', 'Col4']]

   Col3  Col4
2    55    23
3    73    81

In [80]:
df_new.iloc[2:4,0:2]

   Col3      Col5
2    55  1.998618
3    73 -0.261458

In [85]:
df_new

   Col3      Col5  Col4
0    72 -0.807552    86
1    83 -0.627360    25
2    55  1.998618    23
3    73 -0.261458    81

In [88]:
df_new[df_new>70]

   Col3  Col5  Col4
0  72.0   NaN  86.0
1  83.0   NaN   NaN
2   NaN   NaN   NaN
3  73.0   NaN  81.0

In [115]:
df_new[df_new['Col3']>70][['Col3','Col4']] #We can add the condition with logical And ('&') or Or ('|')

   Col3  Col4
0    72    86
1    83    25
3    73    81

In [118]:
df_new['Col3']>70

0     True
1     True
2    False
3     True
Name: Col3, dtype: bool